# გააკეთეთ 30 მაგალითი შედარებით ოპერატორებზე. 

print(10 <= 15)
print(10 <= 20)
print(50 <= 125)
print(40 <= 75)
print(510 <= 1215)
print(15 >= 10)
print(45 >= 40)
print(152 >= 150)
print(1120 >= 690)
print(145 >= 105)
print(15 == 15)
print(25 == 25)
print(45 == 45)
print(55 == 55)
print(35 == 35)
print(15 != 20)
print(15 != 15.5)
print(15 != 1123)
print(15 != 1.15)
print(15 != 1124.5)
print(125 > 124)
print(120 > 119)
print(112320 > 154)
print(11231231231230 > 123123123)
print(120 > 118)
print(1233 < 1212330)
print(1211231231232313 < 124123123123123123)
print(1212312312312 < 1123121231231234)
print(11231231212320 < 112312312321231234)
print(11231231230 < 11234231123123123123123)

# დაწერეთ პროგრამა, რომელიც იღებს ორი ადამიანის ასაკს და განსაზღვრავს ვინ არის უფროსი.

# შესთავაზეთ მომხმარებელს შეიყვანოს პირველი პირის ასაკი.

person1 = int(input("Enter first person's name: "))

# სთხოვეთ მომხმარებელს შეიყვანოს მეორე პირის ასაკი.

person2 = int(input("Enter second person's name: "))

# შეადარეთ ორი ასაკი შედარების ოპერატორების გამოყენებით.

print(person1 < person2)

# გამოიტანეთ შეტყობინება, რომელიც მიუთითებს იმაზე, თუ ვინ არის უფროსი ან იმავე ასაკი

print("The older person is who is", person2, "years old")
